{"config": [{"config": {"batch_input_shape": [null, 1000], "activity_regularizer": null, "trainable": true, "name": "dense_1", "input_dtype": "float32", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 512, "input_dim": null, "W_constraint": null, "activation": "linear", "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "name": "dense_2", "input_dim": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "output_dim": 46, "W_constraint": null, "activation": "linear", "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}], "sample_weight_mode": null, "class_name": "Sequential", "optimizer": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "name": "Adam", "epsilon": 1e-08}, "loss": "categorical_crossentropy", "keras_version": "1.0.4"}