{"keras_version": "1.0.4", "loss": "categorical_crossentropy", "class_name": "Sequential", "sample_weight_mode": null, "optimizer": {"rho": 0.95, "name": "Adadelta", "epsilon": 1e-08, "lr": 1.0}, "config": [{"class_name": "Convolution2D", "config": {"nb_col": 3, "nb_row": 3, "b_regularizer": null, "dim_ordering": "th", "input_dtype": "float32", "activity_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 1, 28, 28], "subsample": [1, 1], "nb_filter": 32, "W_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "bias": true, "activation": "linear", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "th", "name": "convolution2d_2", "trainable": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 32, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "border_mode": "valid", "bias": true, "activation": "linear", "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "name": "dense_1", "trainable": true, "output_dim": 128, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "name": "dense_2", "trainable": true, "output_dim": 10, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "input_dim": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "softmax", "trainable": true}}]}